import React from "react";
import Container from "../ui/container";
import Image from "next/image";
import img1 from "@/public/Frame270989841.png";

export default function BlogsIdPage() {
  return (
    <Container className="flex justify-end gap-6 pt-[160px] pb-[100px]">
      <div className="w-full max-w-[760px]">
        <Image
          className="w-full object-cover rounded-xl aspect-[1.6/1] mb-12"
          alt="img"
          src={img1}
          width={760}
          height={480}
        />

        <p className="text-sm font-normal leading-6 text-left flex items-center text-[#5B6871] mb-4">
          24.07.2024
        </p>
        <h3 className="mb-3 text-2xl font-semibold leading-[29.05px]">
          Совет министров юстиции государств – участников СНГ – о реформах в
          системе юстиции Узбекистана
        </h3>

        <p className="text-[#48535B]  text-base font-normal leading-[26px]">
          Реализация гарантированных прав и интересов граждан, обеспечение
          верховенства закона в обществе является приоритетной задачей органов
          юстиции. Одним из важных шагов в этом направлении стал принятый 24 мая
          2024 года Указ Президента Республики Узбекистан «О дальнейшем
          повышении ответственности и формировании компактной системы управления
          органов и учреждений юстиции в рамках административных реформ». По
          инициативе Главы государства Шавката Мирзиёева органы юстиции
          преобразованы в более народную структуру, ответственную за решение
          правовых вопросов граждан непосредственно на местах, в махаллях.
          Во-первых, органы юстиции будут принимать практические меры
          по выявлению и анализу правовых проблем, возникающих в повседневной
          жизни населения, а также разрабатывать проекты актов законодательства,
          направленные на их устранение. Во-вторых, в качестве помощника граждан
          органы юстиции будут ежемесячно проводить на местах мероприятия «День
          юстиции» для рассмотрения и решения актуальных проблем, поднимаемых
          населением. Кроме того, в махаллях (органы самоуправления граждан),
          расположенных в отдаленных районах, не реже двух раз в месяц будут
          оказываться выездные государственные услуги. В-третьих, в махаллях
          каждая среда недели определена «Днем правовой пропаганды». В этот день
          органы юстиции будут выезжать непосредственно в махалли, встречаться с
          гражданами лицом к лицу, разъяснять им интересующие их вопросы и
          новшества в законодательстве. В-четвертых, в целях более тесного
          внедрения государственных услуг в жизнь каждой махалли и каждого
          гражданина, предпринимателям разрешается предоставлять 15 видов
          государственных услуг в качестве агентов. Еще одно удобство –
          внедрение системы Face-ID при предоставлении государственных услуг,
          которая идентифицирует гражданина, желающего воспользоваться
          государственной услугой, и автоматически определяет информацию о нем.
          При этом предоставление гражданами документов, удостоверяющих их
          личность, не требуется. В-пятых, одним из направлений деятельности
          органов юстиции определены налаживание и координация системы оказания
          бесплатной первичной юридической помощи гражданам. Так, с 1 июля
          2024 года внедряется порядок оказания бесплатной первичной юридической
          помощи гражданам через ННО «Мадад». В зданиях центров государственных
          услуг всех районов (городов) республики будут созданы правовые
          консультативные бюро. Наряду с предоставлением населению бесплатных
          правовых консультаций, бюро будут готовить для граждан необходимые
          процессуальные документы (исковые заявления, жалобы, договоры и
          другие). В-шестых, в Указе определены отдельные меры по методическому
          обеспечению правоприменения в государственных органах, органах местной
          власти и махаллях. При этом будут оптимизированы их функции,
          подготовлены методические пособия и образцы документов, применяемых в
          их деятельности. Министерство юстиции Республики Узбекистан определено
          уполномоченным органом в данном направлении. В-седьмых, большое
          внимание уделяется правовой культуре молодежи, формирование у нее
          правового иммунитета к факторам, оказывающим негативное влияние на ее
          правовое воспитание. Вместе с тем будет организована онлайн-школа
          правовой грамотности и бесплатные учебные курсы по праву. Также
          внедряется система «школа – лицей – техникум – университет» при
          подготовке юридических кадров путем организации «Правовых классов»
          и углубленного изучения правовых предметов в школах республики. Указом
          внедряются новые механизмы, направленные на создание благоприятных
          условий для населения, оказание ему правовой поддержки, реализацию
          гарантированных прав и интересов граждан и трансформацию деятельности
          органов юстиции в данном направлении. В 2024 году Министерство юстиции
          Республики Узбекистан председательствует в Совете министров юстиции
          государств – участников Содружества Независимых Государств.
        </p>
      </div>

      <div className="w-full max-w-[270px]">
        <div className="pb-4 mb-4 border-b border-gray-200">
          <div className="group-hover:text-[#13399A] line-clamp-2 text-base font-semibold leading-6 text-left ">
            Министерство юстиции Республики Узбекистан ОБЪЯВЛЯЕТ Конкурс
          </div>
          <p className="text-sm font-normal leading-6 text-left flex items-center text-[#5B6871]">
            24.07.2024
          </p>
        </div>
        <div className="pb-4 mb-4 border-b border-gray-200">
          <div className="group-hover:text-[#13399A] line-clamp-2 text-base font-semibold leading-6 text-left ">
            Министерство юстиции Республики Узбекистан ОБЪЯВЛЯЕТ Конкурс
          </div>
          <p className="text-sm font-normal leading-6 text-left flex items-center text-[#5B6871]">
            24.07.2024
          </p>
        </div>
        <div className="pb-4 mb-4 border-b border-gray-200">
          <div className="group-hover:text-[#13399A] line-clamp-2 text-base font-semibold leading-6 text-left ">
            Министерство юстиции Республики Узбекистан ОБЪЯВЛЯЕТ Конкурс
          </div>
          <p className="text-sm font-normal leading-6 text-left flex items-center text-[#5B6871]">
            24.07.2024
          </p>
        </div>
      </div>
    </Container>
  );
}
